app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test Photo"], ["body", "Testing testing"], ["created_at", "2020-12-25 22:53:55.140557"], ["updated_at", "2020-12-25 22:53:55.140557"]]

  def remove
    @article = Article.find(params[:article_id])
    @photo = @article.photos.find(params[:photo_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]